Repository: KDE/rocs
Catalog: po/*/libgraphtheory.po
Languages: ar, eo, eu, he, ka

source: Rocs 1 Graph File Format (%1)
ar: تنسيق ملف رسم بياني روكس 1 (%1)
eo: Rocs 1 Grafea Dosierformato (%1)
eu: Rocs 1 grafo-fitxategi formatua (%1)
he: תסדיר קובץ גרף Rocs 1‏ (%1)
ka: Rocs 1-ის გრაფის ფაილის ფორმატი (%1)

source: Could not open file "%1" in write mode: %2
ar: تعذّر فتح الملف «%1» في وضع الكتابة: %2
eo: Ne eblis malfermi la dosieron "%1" en skribreĝimo: %2
eu: Ezin izan du "%1 fitxategia idazteko moduan ireki: %2
he: לא ניתן לפתוח את הקובץ „%1” במצב כתיבה: %2
ka: "%1" ფაილის ჩასაწერად გახსნის შეცდომა: %2

source: Could not write data, aborting. Error: %1.
ar: تعذّر كتابة البيانات، إجهاض. الخطأ: %1.
eo: Ne eblis skribi datumojn, ĉesigante. Eraro: %1.
eu: Ezin izan du daturik idatzi, bertan behera zuten. Errorea: %1.
he: לא ניתן לכתוב את הנתונים, הפעולה מבוטלת. שגיאה: %1.
ka: ჩაწერა შეუძლებელია. შეცდომა: %1.

source: Rocs Graph Format (%1)
ar: تنسيق رسم بياني روكس (%1)
eo: Rocs-Grafea Formato (%1)
eu: Rocs grafo-formatua (%1)
he: תסדיר גרף Rocs ‏(%1)
ka: Rocs -ის გრაფის ფორმატი (%1)

source: Error on serializing file format to file.
ar: خطأ في تسلسل تنسيق الملف إلى ملف.
eo: Eraro dum seriigado de dosierformato al dosiero.
he: שגיאה בשרשור תסדיר קובץ לקובץ.
ka: ფაილის ფორმატის ფაილამდე სერიალიზაციის შეცდომა.

source: Trivial Graph Format (%1)
ar: تنسيق رسم بياني تافه (%1)
eo: Triviala Grafea Formato (%1)
eu: Trivial grafo-formatua (%1)
he: תסדיר גרף Trivial ‏(%1)
ka: ტრივიალური გრაფის ფორმატი (%1)

source: Could not parse file. Identifier "%1" is used more than once.
ar: تعذّر تحليل الملف. المعرّف «%1» قيد الاستخدام أكثر من مرة.
eo: Ne eblis analizi dosieron. La identigilo "%1" estas uzata pli ol unufoje.
he: לא ניתן לפענח את הקובץ. נעשה שימוש במזהה „%1” יותר מפעם אחת.
ka: ფაილის ანალიზი შეუძლებელია. იდენტიფიკატორი "%1" ერთზე მეტჯერ გამოიყენება.

source: Could not parse file. Edge from "%1" to "%2" uses undefined nodes.
ar: تعذّر تحليل الملف. حافة من «%1» إلى «%2» تستخدم عقدًا غير مُعرّفة.
eo: Ne eblis analizi dosieron. Eĝo de "%1" al "%2" uzas nedifinitajn nodojn.
he: לא ניתן לפענח את הקובץ. הצלע מ־„%1” ל־„%2” משתמשת בצמתים לא מוגדרים.
ka: ფაილის ანალიზი შეუძლებელია. წიბო "%1"-დან "%2"-მდე დაუზუსტებელ კვანძებს იყენებს.

source: TikZ (PGF) Format (%1)
ar: تنسيق TikZ (PGF) (%1)
eo: TikZ (PGF) Formato (%1)
eu: TikZ (PGF) formatua (%1)
he: תסדיר TikZ (PGF) ‏(%1)
ka: TikZ (PGF) ფორმატი (%1)

source: Default
ar: المبدئيّ
eo: Defaŭlte
eu: Lehenetsia
he: ברירת מחדל
ka: ნაგულისხმები

# @title:tab initial title for graph document
source: New Graph
ar: رسم بياني جديد
eo: Nova Grafeo
eu: Grafo berria
he: גרף חדש
ka: ახალი გრაფი

# @info:shell
source: %1: no node with ID %2 registered
ar: %1: لا يوجد عقدة مُسجّلة بالمعرّف %2
eo: %1: neniu nodo kun ID %2 registrita
eu: %1: ez dago %2 ID duen nodorik erregistratu
he: %1: לא נרשם צומת עם המזהה %2
ka: %1: ID-ით %2 რეგისტრირებული კვანძი აღმოჩენილი არაა

# @info:shell
source: %1: node type ID %2 not registered
ar: %1: معرّف نوع العقدة %2 غير مُسجّل
eo: %1: nodo-tipo ID %2 ne registrita
eu: %1: %2 ID nodo-mota ez dago erregistratuta
he: %1: לא נרשם טיפוס צומת עם המזהה %2
ka: %1: კვანძის ტიპი ID-ით %2 რეგისტრირებული არაა

# @info:shell
source: %1: edge type ID %2 not registered
ar: %1: معرّف نوع الحافة %2 غير مُسجّل
eo: %1: eĝtipa ID %2 ne registrita
eu: %1: %2 ID ertz-mota ez dago erregistratuta
he: %1: לא נרשם טיפוס צלעעם המזהה %2
ka: %1: წიბოს ტიპი ID-ით %2 რეგისტრირებული არაა

# @info:shell
source: %1: "from" is not a valid node object
ar: %1: "from" ليس كائن عقدة صالح
eo: %1: "de" ne estas valida noda objekto
he: %1: „from” (מ־) הוא לא עצם צומת תקף.
ka: %1: *from* სწორი კვანძის ობიექტი არაა

# @info:shell
source: %1: "to" is not a valid node object
ar: %1: "to" ليس كائن عقدة صالح
eo: %1: "al" ne estas valida noda objekto
he: %1: „from” (ל־) הוא לא עצם צומת תקף.
ka: %1: "to" სწორი კვანძის ობიექტი არაა

# @info:shell
source: %1: "node" is not a valid node object
ar: %1: "node" ليس كائن عقدة صالح
eo: %1: "nodo" ne estas valida noda objekto

# @info:shell
source: %1: "edge" is not a valid edge object
ar: %1: "edge" ليس كائن حافة صالح
eo: %1: "eĝo" ne estas valida eĝobjekto

# @info status message after successful script execution
source: <i>Execution Finished</i>
ar: <i>انتهى التنفيذ</i>
eo: <i>Efektivigo Finita</i>

# Scripting API
source: The global Console object allows you to print messages of different importance to a log.
ar: كائن وحدة التحكم العام يسمح لك بطباعة رسائل ذات أهمية مختلفة إلى السجل.
eo: La tutmonda Konzolo-objekto permesas presi mesaĝojn de malsama graveco al protokolo.
he: עצם המסוף המקיף מאפשר לך להדפיס הודעות בדרגות חשיבות שונות ליומן.
ka: გლობალური ობიექტი 'Console' საშუალებას გაძლევთ, სხვადასხვა მნიშვნელოვნობის მქონე შეტყობინებები ჟურნალში ჩაწეროთ.

# Scripting API
source: Print the given message of normal severity.
ar: اطبع الرسالة المعطاة ذات الخطورة العادية.
eo: Presi la donitan mesaĝon de normala severeco.
he: הצגת ההודעה שסופקה בחשיבות רגילה.
ka: ნორმალური სიმძიმის მქონე მითითებული შეტყობინების გამოტანა.

# Scripting API
source: Print the given debug message.
ar: اطبع رسالة التصحيح المعطاة.
eo: Presi la donitan sencimigan mesaĝon.
he: הדפסת הודעת ניפוי השגיאות שסופקה.
ka: მითითებული გამართვის შეტყობინებების გამოტანა.

# Scripting API
source: Print the given error message of high severity.
ar: اطبع رسالة الخطأ المعطاة ذات الخطورة العالية.
eo: Presi la donitan erarmesaĝon de alta severeco.
he: הדפסת הודעת השגיאה שסופקה בדרגת חומרה גבוהה.
ka: მაღალი სიმძიმის მქონე მითითებული შეტყობინების გამოტანა.

# Scripting API
source: The document object provides access to all elements.
ar: يوفر كائن المستند وصولًا إلى جميع العناصر.
eo: La dokumentobjekto donas aliron al ĉiuj elementoj.
he: עצם המסמך מספק גישה לכל הרכיבים.
ka: დოკუმენტის ობიექტი წვდომას ყველა ობიექტთან მოგაწვდით.

# Scripting API
source: Return the node with specified ID.
ar: أرجع العقدة بالمعرّف المحدد.
eo: Redoni la nodon kun specifita ID.
eu: Itzuli zehatutako ID duen nodoa.
he: החזרת הצומת עם המזהה שצוין.
ka: აბრუნებს მითითებული ID-ის მქონე კვანძს.

# Scripting API
source: Identifier of a node.
ar: معرّف العقدة.
eo: Identigilo de nodo.
eu: Nodo baten identifikatzailea.
he: מזהה צומת.
ka: კვანძის იდენტიფიკატორი.

# Scripting API
source: Return a list of all nodes.
ar: أرجع قائمة بجميع العقد.
eo: Redoni liston de ĉiuj nodoj.
eu: Itzuli nodo guztien zerrenda bat.
he: החזרת רשימת כל הצמתים.
ka: ყველა კვანძის სიის დაბრუნება.

# Scripting API
source: Return a list all nodes of specified type.
ar: أرجع قائمة بجميع العقد من النوع المحدد.
eo: Redoni liston de ĉiuj nodoj de specifita tipo.
eu: Itzuli zehaztutako motako nodo guztien zerrenda bat.
he: החזרת רשימה של כל הצמתים מטיפוס מסוים.
ka: მითითებული ტიპის კვანძების სიის დაბრუნება.

# Scripting API
source: Identifier of a node type.
ar: معرّف نوع العقدة.
eo: Identigilo de noda tipo.
eu: Nodo-mota baten identifikatzailea.
he: מזהה טיפוס צומת.
ka: კვანძის ტიპის იდენტიფიკატორი.

# Scripting API
source: Return a list of all edges.
ar: أرجع قائمة بجميع الحواف.
eo: Redoni liston de ĉiuj eĝoj.
eu: Itzuli ertz guztien zerrenda bat.
he: החזרת רשימת כל הצלעות.
ka: აბრუნებს ყველა წიბოს სიას.

# Scripting API
source: Return a list all edges of specified type.
ar: أرجع قائمة بجميع الحواف من النوع المحدد.
eo: Redoni liston de ĉiuj eĝoj de specifita tipo.
eu: Itzuli zehaztutako motako ertz guztien zerrenda bat.
he: החזרת רשימה של כל הצלעות מטיפוס מסוים.
ka: აბრუნებს მითითებული ტიპის ყველა წიბოს სიას.

# Scripting API
source: Identifier of an edge type.
ar: معرّف نوع الحافة.
eo: Identigilo de eĝospeco.
eu: Ertz-mota baten identifikatzailea.
he: מזהה טיפוס צלע.
ka: წიბოს ტიპის იდენტიფიკატორი.

# Scripting API
source: Create node at position (x,y).
ar: أنشئ عقدة عند الموضع (س، ص).
eo: Krei nodon ĉe pozicio (x,y).
eu: Sortu nodoa (x,y) kokalekuan.
he: יצירת צומת בנקודה מסוימת (x,y).
ka: კვანძის შექმნა პოზიციაზე (x,y).

# Scripting API
source: X-coordinate of the node.
ar: إحداثي س للعقدة.
eo: X-koordinato de la nodo.
eu: Nodoaren X-koordenatua.
he: נקודת הציון ב־X של הצומת.
ka: კვანძის X კოორდინატი.

# Scripting API
source: Y-coordinate of the node.
ar: إحداثي ص للعقدة.
eo: Y-koordinato de la nodo.
eu: Nodoaren Y-koordenatua.
he: נקודת הציון ב־Y של הצומת.
ka: კვანძის Y კოორდინატი.

# Scripting API
source: Create edge between the given nodes of default edge type.
ar: أنشئ حافة بين العقد المعطاة بنوع الحافة المبدئي.
eo: Krei eĝon inter la donitaj nodoj de defaŭlta eĝtipo.
he: יצירת צלע בין הצמתים הנבחרים של טיפוס צלע כברירת מחדל.
ka: წიბოს შექმნა ნაგულისხმევი წიბოს ტიპის მითითებულ კვანძებს შორის.

# Scripting API
source: Start node of the edge.
ar: عقدة بداية الحافة.
eo: Komenci nodon de la eĝo.
he: צומת התחלת הצלע.
ka: წიბოს საწყისი კვანძი.

# Scripting API
source: Target node of the edge.
ar: عقدة هدف الحافة.
eo: Celnodo de la eĝo.
he: צומת יעד הצלע.
ka: წიბოს სამიზნე კვანძი.

# Scripting API
source: Delete the given node.
ar: احذف العقدة المعطاة.
eo: Forigi la donitan nodon.
eu: Ezabatu adierazitako nodoa.
he: מחיקת הצומת שסופק.
ka: მოცემული კვანძის წაშლა.

# Scripting API
source: The node to be deleted.
ar: العقدة المراد حذفها.
eo: La nodo por esti forigita.
eu: Ezabatu beharreko nodoa.
he: הצומת למחיקה.
ka: წასაშლელი კვანძი.

# Scripting API
source: Delete the given edge.
ar: احذف الحافة المعطاة.
eo: Forigi la donitan eĝon.
eu: Ezabatu adierazitako ertza.
he: מחיקת הצלע שסופקה.
ka: მოცემული წიბოს წაშლა.

# Scripting API
source: The edge to be deleted.
ar: الحافة المراد حذفها.
eo: La eĝo forigenda.
eu: Ezabatu beharreko ertza.
he: הצלע למחיקה.
ka: წასაშლელი წიბო.

# Scripting API
source: An edge is the connection of two nodes. Edges can be either directed or undirected, depending on their type.
ar: الحافة هي وصلة بين عقدتين. يمكن أن تكون الحواف موجهة أو غير موجهة، يعتمد ذلك على نوعها.
eo: Eĝo estas la ligo de du nodoj. Eĝoj povas esti aŭ direktitaj aŭ nedirektitaj, depende de sia tipo.
he: צלע הוא החיבור בין שני צמתים. צלעות יכולות להיות כיווניות או ללא כיוון, כתלות בטיפוס שלהן.
ka: წიბო ორი კვანძის კავშირია. წიბო შეიძლება ან მიმართული იყოს, ან არამიმართული, მათი ტიპის მიხედვით.

# Scripting API
source: Read and set the identifier of the edge's type. If setting, the edge type identifier must exist.
ar: اقرأ واضبط معرّف نوع الحافة. عند الضبط، يجب أن يوجد معرّف نوع الحافة.
eo: Legi kaj meti la identigilon de la tipo de la eĝo. Se metante, la eĝtipa identigilo devas ekzisti.
he: קריאת והגדרת מזהה טיפוס הצלע. במקרה של הגדרה, מזהה טיפוס הצלע חייב להיות קיים.
ka: წიბოს ტიპის იდენტიფიკატორის წაკითხვა და დაყენება. თუ ეს პარამეტრია, წიბოს ტიპის იდენტიფიკატორი უნდა არსებობდეს.

# Scripting API
source: Return the origin node of the edge.
ar: أرجع عقدة الأصل للحافة.
eo: Redoni la originnodon de la eĝo.
he: החזרת צומת המקור של הצלע.
ka: აბრუნებს წიბოს საწყის კვანძს.

# Scripting API
source: Return the target node of the edge.
ar: أرجع عقدة الهدف للحافة.
eo: Redoni la celnodon de la eĝo.
he: החזרת צומת היעד של הצלע.
ka: აბრუნებს წიბოს სამიზნე კვანძს.

# Scripting API
source: Returns true if the edge's type is directed, otherwise false.
ar: يرجع "صحيح" إن كان نوع الحافة موجهاً، وإلا "خاطئ".
eo: Liveras vera se la tipo de la eĝo estas direktita, alie malvera.
he: החזרת חיובי (true) אם טיפוס הצלע זוהה, אחרת שלילי (false).
ka: აბრუნებს ჭეშმარიტს, თუ წიბოს ტიპი მიმართულია და ცრუს, თუ არა.

# Scripting API
source: A node is the data element of a graph. It can have arbitrary dynamic properties that are either set in the editor or simply assigned on run-time. Note that dynamic properties are only available after script execution, if they are registered for the node's type.
ar: العقدة هي عنصر بيانات الرسم البياني. يمكن أن تحمل خاصيات ديناميكية اختيارية تضبط في المحرر أو تسند ببساطة أثناء التنفيذ. لاحظ أن الخاصيات الديناميكية تتوفر فقط بعد تنفيذ النص البرمجي، إذا كانت مُسجّلة لنوع العقدة.
eo: Nodo estas la datenelemento de grafeo. Ĝi povas havi arbitrajn dinamikajn ecojn kiuj estas aŭ agordita en la redaktilo aŭ simple asignitaj dum rultempo. Rimarku, ke dinamikaj trajtoj estas nur haveblaj post skriptefektivigo, se ili estas registritaj por la tipo de la nodo.
he: צומת הוא רכיב הנתונים של גרף. יכולים להיות לו משתנים דינמיים שרירותיים שמוגדרים בעורך או פשוט מוקצים בזמן הריצה. נא לשיב לב שמאפיינים דינמיים זמינים רק לאחר הרצת סקריפטים, אם הם רשומים לטיפוס הצומת.
ka: კვანძი გრაფის მონაცემთა ელემენტია. მას შეიძლება ჰქონდეს ნებისმიერი დინამიკური თვისებები, რომლებიც ან რედაქტორშია დაყენებული, ან უმარტივესად ენიჭება შესრულების დროს. გაითვალისწინეთ, რომ დინამიკური თვისებები, მხოლოდ, სკრიპტის შესრულების შემდეგაა ხელმისაწვდომი, თუ ისინი რეგისტრირებულია ამ კვანძის იტიპისთვის.

# Scripting API
source: Read and set the unique identifier of this node.
ar: اقرأ واضبط المعرّف الفريد لهذه العقدة.
eo: Legi kaj meti la unikan identigilon de ĉi tiu nodo.
eu: Irakurri eta ezarri nodo honen identifikatzaile bakarra.
he: קריאת והגדרת המזהה הייחודי של הצומת הזה.
ka: ამ კვანძის უნიკალური იდენტიფიკატორის წაკითხვა და დაყენება.

# Scripting API
source: Read and set the x-coordinate of the node.
ar: اقرأ واضبط إحداثي س للعقدة.
eo: Legi kaj meti la x-koordinaton de la nodo.
eu: Irakurri eta ezarri nodoaren X-koordenatua.
he: קריאת והגדרת נקודת הציון ב־x של הצומת.
ka: კვანძის X კოორდინატის წაკითხვა და დაყენება.

# Scripting API
source: Read and set the y-coordinate of the node.
ar: اقرأ واضبط إحداثي ص للعقدة.
eo: Legi kaj meti la y-koordinaton de la nodo.
eu: Irakurri eta ezarri nodoaren Y-koordenatua.
he: קריאת והגדרת נקודת הציון ב־y של הצומת.
ka: კვანძის Y კოორდინატის წაკითხვა და დაყენება.

# Scripting API
source: Read and set the color string of this node in hex values (e.g., "#ff0000" for red).
ar: اقرأ واضبط سلسلة لون هذه العقدة بقيم سداسية عشرية (مثلاً، "#ff0000" للأحمر).
eo: Legi kaj meti la kolorĉenon de ĉi tiu nodo en deksesaj valoroj (ekz., "#ff0000" por ruĝa).
eu: Irakurri eta ezarri nodo honen kolorearen katea balio hamaseitarretan (adib. "#ff0000" gorrirako).
he: קריאת והגדרת מחרוזת צבע של הצומת הזה בערכים הקסדצימליים (למשל: „‎#ff0000” עבור אדום).
ka: ამ კვანძის ფერის სტრიქონის დაყენება და წაკითხვა თექვსმეტობით მნიშვნელობაში (მაგ: "#ff0000" წითელია).

# Scripting API
source: Read and set the identifier of the node's type. If setting, the node type identifier must exist.
ar: اقرأ واضبط معرّف نوع العقدة. عند الضبط، يجب أن يوجد معرّف نوع العقدة.
eo: Legi kaj meti la identigilon de la tipo de la nodo. Se agordado, la nodotipa identigilo devas ekzisti.
eu: Irakurri eta ezarri nodo-motaren identifikatzailea. Ezarriz gero, nodo-mota identifikatzailea existitu behar da.
he: קריאת והגדרת מזהה טיפוס הצומת. במקרה של הגדרה, מזהה טיפוס הצומת חייב להיות קיים.
ka: კვანძის ტიპის იდენტიფიკატორის წაკითხვა და დაყენება. კვანძის ტიპი იდენტიფიკატორი უნდა არსებობდეს.

# Scripting API
source: Return a list of all edges (incoming and outgoing) of this node.
ar: أرجع قائمة بجميع حواف هذه العقدة (الداخلة والخارجة).
eo: Liveri liston de ĉiuj eĝoj (envenantaj kaj elirantaj) de ĉi tiu nodo.
eu: Itzuli nodo honen ertz guztien (sarrerakoak eta irteerakoak) zerrenda bat.
he: החזרת רשימת כל הצלעות (נכנסות ויוצאות) של הצומת הזה.
ka: აბრუნებს ამ კვანძის ყველა წიბოს (შემომავალი და გამავალი) სიას.

# Scripting API
source: Return a list of all edges (incoming and outgoing) of this node of a specified type.
ar: أرجع قائمة بجميع حواف هذه العقدة (الداخلة والخارجة) من نوع محدد.
eo: Liveri liston de ĉiuj Eĝoj (envenantaj kaj elirantaj) de ĉi tiu nodo de specifita tipo.
eu: Itzuli nodo honen, zehaztutako motako ertz guztien (sarrerakoak eta irteerakoak) zerrenda bat.
he: החזרת רשימת כל הצלעות (נכנסות ויוצאות) של הצומת הזה מטיפוס מסוים.
ka: აბრუნებს მითითებული ტიპის ამ კვანძის ყველა წიბოს (შემომავალი და გამავალი) სიას.

# Scripting API
source: Return a list of incoming edges of this node.
ar: أرجع قائمة بالحواف الداخلة لهذه العقدة.
eo: Liveri liston de alvenantaj eĝoj de ĉi tiu nodo.
eu: Itzuli nodo honen sarrerako ertzen zerrenda bat.
he: החזרת רשימה של צלעות נכנסות לצומת הזה.
ka: აბრუნებს ამ კვანძის შემომავალი წიბოების სიას.

# Scripting API
source: Return a list of all incoming edges of this node of a specified type.
ar: أرجع قائمة بجميع الحواف الداخلة لهذه العقدة من نوع محدد.
eo: Liveri liston de ĉiuj alvenantaj eĝoj de ĉi tiu nodo de specifa tipo.
eu: Itzuli nodo honen, zehaztutako motako sarrerako ertz guztien zerrenda bat.
he: החזרת רשימה של הצלעות הנכנסות לצומת הזה מטיפוס מסוים.
ka: აბრუნებს მითითებული ტიპის ამ კვანძის ყველა შემომავალი წიბოს სიას.

# Scripting API
source: Return a list of all outgoing edges of this node.
ar: أرجع قائمة بجميع الحواف الخارجة لهذه العقدة.
eo: Liveri liston de ĉiuj elirantaj eĝoj de ĉi tiu nodo.
eu: Itzuli nodo honen irteerako ertz guztien zerrenda bat.
he: החזרת רשימה של כל הצלעות היוצאות מהצומת הזה.
ka: აბრუნებს ამ კვანძის გამავალი წიბოების სიას.

# Scripting API
source: Return a list of all outgoing edges of this node of a specified type.
ar: أرجع قائمة بجميع الحواف الخارجة لهذه العقدة من نوع محدد.
eo: Liveri liston de ĉiuj elirantaj eĝoj de ĉi tiu nodo de specifita tipo.
eu: Itzuli nodo honen, zehaztutako motako irteerako ertz guztien zerrenda bat.
he: החזרת רשימה של כל הצלעות היוצאות מהצומת הזה מטיפוס מסוים.
ka: აბრუნებს მითითებული ტიპის ამ კვანძის ყველა გამავალი წიბოს სიას.

# Scripting API
source: Return list all nodes connected to this node. This method respects if edges are directed.
ar: أرجع قائمة بجميع العقد الموصولة بهذه العقدة. تحترم هذه الطريقة ما إذا كانت الحواف موجهة.
eo: Liveri liston de ĉiuj nodoj konektitaj al ĉi tiu nodo. Ĉi tiu metodo respektas se eĝoj estas direktitaj.
he: החזרת רשימה של כל הצמתים שמחוברים לצומת הזה. השיטה הזאת מכבדת את מצב כיווניות של צלעות.
ka: აბრუნებს ამ კვანძთან დაკავშირებული ყველა კვანძის სიას. ეს მეთოდი ითვალისწინებს იმ წიბოებს, რომლებიც მიმართულია.

# Scripting API
source: Return list all nodes connected to this node via an edge of specified type. This method respects if edges are directed.
ar: أرجع قائمة بجميع العقد الموصولة بهذه العقدة عبر حافة من نوع محدد. تحترم هذه الطريقة ما إذا كانت الحواف موجهة.
eo: Liveri liston de ĉiuj nodoj konektitaj al ĉi tiu nodo per eĝo de specifita tipo. Ĉi tiu metodo respektas se eĝoj estas direktitaj.
he: החזרת רשימה של כל הצמתים שמחוברים לצומת הזה דרך צלע מטיפוס שצוין. השיטה הזאת מכבדת מצב כיווניות של צלעות.
ka: აბრუნებს ყველა იმ კვანძს, რომელიც ამ კვანძთან მითითებული ტიპის წიბოს გავლითაა დაკავშირებული. ეს მეთოდი ითვალისწინებს იმ წიბოებს, რომლებიც მიმართულია.

# Scripting API
source: Return a list all nodes connected to this node by an incoming edge.
ar: أرجع قائمة بجميع العقد الموصولة بهذه العقدة بحافة داخلة.
eo: Liveri liston de ĉiuj nodoj ligitaj al ĉi tiu nodo per envenanta eĝo.
eu: Itzuli nodo honetara sarrerako ertz baten bidez konektatutako nodo guztien zerrenda bat.
he: החזרת רשימה של כל הצמתים המחוברים לצומת הזה על ידי צלע נכנסת.
ka: აბრუნებს ყველა იმ კვანძის სას, რომლებიც ამ კვანძთან შემომავალი წიბოთია დაკავშირებული.

# Scripting API
source: Return a list all nodes connected to this node by an incoming edge of specified type.
ar: أرجع قائمة بجميع العقد الموصولة بهذه العقدة بحافة داخلة من نوع محدد.
eo: Liveri liston de ĉiuj nodoj ligitaj al ĉi tiu nodo per alvenanta eĝo de specifita tipo.
eu: Itzuli nodo honetara, zehaztutako motako sarrerako ertz baten bidez konektatutako nodo guztien zerrenda bat.
he: החזרת רשימה של כל הצמתים המחוברים לצומת הזה על ידי צלע נכנסת מטיפוס מסוים.
ka: აბრუნებს ყველა იმ კვანძის სას, რომლებიც ამ კვანძთან შემომავალი, მითითებული ტიპის წიბოთია დაკავშირებული.

# Scripting API
source: Return list all nodes connected to this node by an outgoing edge.
ar: أرجع قائمة بجميع العقد الموصولة بهذه العقدة بحافة خارجة.
eo: Liveri liston de ĉiuj nodoj ligitaj al ĉi tiu nodo per elira eĝo.
eu: Itzuli nodo honetara irteerako ertz baten bidez konektatutako nodo guztien zerrenda bat.
he: החזרת רשימה של כל הצמתים המחוברים לצומת הזה על ידי צלע יוצאת.
ka: აბრუნებს ყველა იმ კვანძის სას, რომლებიც ამ კვანძთან გამავალი წიბოთია დაკავშირებული.

# Scripting API
source: Return list all nodes connected to this node by an outgoing edge of specified type.
ar: أرجع قائمة بجميع العقد الموصولة بهذه العقدة بحافة خارجة من نوع محدد.
eo: Liveri liston de ĉiuj nodoj ligitaj al ĉi tiu nodo per elira eĝo de specifita tipo.
eu: Itzuli nodo honetara, zehaztutako motako irteerako ertz baten bidez konektatutako nodo guztien zerrenda bat.
he: החזרת רשימה של כל הצמתים המחוברים לצומת הזה על ידי צלע יוצאת מטיפוס מסוים.
ka: აბრუნებს ყველა იმ კვანძის სას, რომლებიც ამ კვანძთან გამავალი, მითითებული ტიპის წიბოთია დაკავშირებული.

# Scripting API
source: Return list of distances to specified targets in same order.
ar: أرجع قائمة بالمسافات إلى الأهداف المحددة بنفس الترتيب.
eo: Redoni liston de distancoj al specifitaj celoj en la sama ordo.
he: החזרת רשימה של מרחקים ליעדים מסוימים באותו הסדר.
ka: აბრუნებს მითითებულ სამიზნეებამდე მანძილის სიას იგივე მიმდევრობით.

# Scripting API
source: Name of edge property that holds the edge length.
ar: اسم خاصية الحافة التي تحمل طول الحافة.
eo: Nomo de eĝtrajto, kiu tenas la eĝlongon.
he: שם מאפיין צלע שמאחסן את אורך הצלע.
ka: წიბოს თვისების სახელი, რომელიც წიბოს სიგრძეს შეიცავს.

# Scripting API
source: List of nodes to that the distances shall be computed.
ar: قائمة العقد التي تحسب المسافات إليها.
eo: Listo de nodoj al kiuj la distancoj devas esti kalkulitaj.
he: רשימת הצמתים לחישוב המרחקים.
ka: კვანძების სია, რომლებამდე მანძილიც უნდა გამოითვალოს.

# @title:column
source: Edge
ar: الحافة
eo: Eĝo
ka: კუთხე

# @title:column
source: EdgeProperty
ar: خاصية الحافة
eo: EĝTrajto
ka: წიბოსთვისება

# @title:column
source: Edge Type
ar: نوع الحافة
eo: Eĝotipo
ka: კიდის ტიპი

# @title:column
source: EdgeTypeProperty
ar: خاصية نوع الحافة
eo: EĝTipTrajto
ka: წიბოსტიპისთვისება

# @title:column
source: Node
ar: عقدة
eo: Nodo
ka: კვანძი

# @title:column
source: NodeProperty
ar: خاصية العقدة
eo: NodoTrajto
ka: კვანძისთვისება

# @title:column
source: Node Type
ar: نوع العقدة
eo: Noda Tipo
ka: კვანძის ტიპი

# @title:column
source: NodeTypeProperty
ar: خاصية نوع العقدة
eo: NodTipTrajto
ka: კვანძისტიპისთვისება

source: Create Edge
ar: أنشئ حافة
eo: Krei Eĝon
eu: Sortu ertza
he: יצירת צלע
ka: კიდის შექმნა

source: Create an edge between two nodes
ar: أنشئ حافة بين عقدتين
eo: Krei eĝon inter du nodoj
he: יצירת צלע בין שתי נקודות

source: Create Node
ar: أنشئ عقدة
eo: Krei Nodon
eu: Sortu nodoa
he: יצירת צומת
ka: კვანძის შექმნა

source: Add a node to the scene
ar: أضف عقدة إلى المشهد
eo: Aldoni nodon al la sceno
he: הוספת נקודה לסצנה

source: Delete Element
ar: احذف العنصر
eo: Forigi Elementon
eu: Ezabatu elementua
he: מחיקת רכיב
ka: ელემენტის წაშლა

source: Delete element from scene
ar: احذف العنصر من المشهد
eo: Forigi elementon de sceno
he: מחיקת פריט מהסצנה

source: Select & Move
ar: اختَر وحرِّك
eo: Elekti & Movi
eu: Hautatu eta mugitu
he: בחירה והזזה
ka: მონიშნეთ & გადაიტანეთ

source: Select and move elements on the scene
ar: اختَر وحرِّك العناصر على المشهد
eo: Elekti kaj movi elementojn sur la sceno
he: אפשר לבחור ולהזיז פריטים בסצנה

# @info:shell
source: %1: "obj" is not called on an object
he: %1: „obj” לא נקרא על עצם
ka: %1: ობიექტზე "obj" გამოძახებული არაა

# @info:shell
source: %1: "obj" is neither a valid node or edge object
he: %1: „obj” אינו עצם צומת או צומת תקף
ka: %1: "obj" არც სწორი კვანძია, არც წიბოს ობიექტი
