Repository: KDE/rocs
Catalog: po/*/libgraphtheory.po
Languages: ar, eo, eu, he, ka

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
eo: Axel Rousseau,Oliver Kellogg
eu: Iñigo Salvador Azurmendi
he: צוות התרגום של KDE ישראל
ka: Temuri Doghonadze

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
eo: axel@esperanto-jeunes.org,okellogg@users.sourceforge.net
eu: xalba@ni.eus
he: kde-l10n-he@kde.org
ka: Temuri.doghonadze@gmail.com

# @title:window
source: Edge Properties
ar: خصائص الحافة
eo: Eĝtrajtoj
eu: Ertzaren propietateak
he: מאפייני צלע
ka: კიდის თვისებები

source: Name
ar: الاسم
eo: Nomo
eu: Izena
he: שם
ka: სახელი

source: Value
ar: القيمة
eo: Valoro
eu: Balioa
he: ערך
ka: მნიშვნელობა

source: Edge Properties
ar: خصائص الحافة
eo: Eĝtrajtoj
eu: Ertzaren propietateak
he: מאפייני צלע
ka: კიდის თვისებები

source: Type:
ar: النوع:
eo: Tipo:
eu: Mota:
he: טיפוס:
ka: ტიპი:

source: Dynamic Properties
ar: الخصائص الديناميكية
eo: Dinamikaj Trajtoj
eu: Propietate dinamikoak
he: מאפיינים דינמיים
ka: დინამიკური თვისებები

source: Edges
ar: الحواف
eo: Eĝoj
eu: Ertzak
he: צלעות
ka: კიდეები

source: Property names
ar: أسماء الخاصيات
eo: Trajtnomoj
eu: Propietate-izenak
he: שמות מאפיינים
ka: თვისების სახელები

# @title:window
source: Edge Type Properties
ar: خصائص نوع الحافة
eo: Eĝtipaj Trajtoj
eu: Ertz-motaren propietateak
he: מאפייני טיפוס צלע
ka: კიდის ტიპის თვისებები

source: Name:
ar: الاسم:
eo: Nomo:
eu: Izena:
he: שם:
ka: სახელი:

source: Identifier:
ar: المعرّف:
eo: Identigilo:
eu: Identifikatzailea:
he: מזהה:
ka: იდენტიფიკატორი:

source: Color:
ar: اللون:
eo: Koloro:
eu: Kolorea:
he: צבע:
ka: ფერი:

source: Unidirectional
ar: أحادي الاتّجاه
eo: Unudirekta
eu: Noranzko bakarrekoa
he: חד־כיווני
ka: ცალმხრივი

source: Bidirectional
ar: ثنائي الاتّجاه
eo: Dudirekta
eu: Bi noranzkoa
he: דו־כיוונית
ka: ორმხრივი

source: Direction:
ar: الاتّجاه:
eo: Direkto:
eu: Noranzkoa:
he: כיוון:
ka: მიმართულება:

source: Visibility:
ar: الظّهور:
eo: Videbleco:
eu: Ikusgaitasuna:
he: חשיפה:
ka: ხილვადობა:

# @info:tooltip
source: The selected ID for this edge type.
ar: المعرّف المختار لنوع الحافة هذا.
eo: La elektita ID por ĉi tiu eĝotipo.
eu: Ertz-mota honetarako hautatutako ID.
he: המזהה לטיפוס הצלע הזה.
ka: მონიშნული ID ამ წიბოს ტიპისთვის.

# @info:tooltip
source: The selected ID is already used for another edge type, please select a different one.
ar: المعرّف المختار قيد الاستخدام بالفعل لنوع حافة آخر، اختر معرّفًا مختلفًا.
eo: La elektita ID jam estas uzata por alia eĝotipo, bonvolu elekti alian.
eu: Hautatutako ID jada beste ertz-mota baterako erabiltzen da, mesedez, hautatu beste bat.
he: המזהה שנבחר כבר משמש לטיפוס אחר של צלע, נא לבחור מזהה אחר.
ka: მონიშნული ID უკვე გამოიყენება სხვა წიბოს ტიპისთვის. აირჩიეთ სხვა.

# @title:window
source: Node Properties
ar: خصائص العقدة
eo: Nodaj Propraĵoj
eu: Nodoaren propietateak
he: מאפייני צומת
ka: კვანძის თვისებები

# @info:tooltip
source: The selected ID for this node.
ar: المعرّف المختار لهذه العقدة.
eo: La elektita ID por ĉi tiu nodo.
eu: Nodo honetarako hautatutako ID.
he: המזהה הנבחר לצומת הזה.
ka: მონიშნული ID ამ კვანძისთვის.

# @info:tooltip
source: The selected ID is already used for another node, please select a different one.
ar: المعرّف المختار قيد الاستخدام بالفعل لعقدة أخرى، اختر معرّفًا مختلفًا.
eo: La elektita ID jam estas uzata por alia nodo, bonvolu elekti alian.
eu: Hautatutako ID jada beste nodo-mota baterako erabiltzen da, mesedez, hautatu beste bat.
he: המזהה שנבחר כבר משמש לצומת אחר, נא לבחור מזהה אחר.
ka: მონიშნული ID უკვე გამოიყენება სხვა კვანძისთვის. აირჩიეთ სხვა.

source: Node Properties
ar: خصائص العقدة
eo: Nodaj Propraĵoj
eu: Nodoaren propietateak
he: מאפייני צומת
ka: კვანძის თვისებები

source: Node color
ar: لون العقدة
eo: Noda koloro
eu: Nodoaren kolorea
he: צבע צומת
ka: კვანძის ფერი

source: Nodes
ar: العقد
eo: Nodoj
eu: Nodoak
he: צמתים
ka: კვანძები

# @title:window
source: Node Type Properties
ar: خصائص نوع العقدة
eo: Propraĵoj de Nodo-Tipo
eu: Nodo-motaren propietateak
he: מאפייני טיפוס צומת
ka: კვანძის ტიპის თვისებები

# @info:tooltip
source: The selected ID for this node type.
ar: المعرّف المختار لنوع العقدة هذا.
eo: La elektita ID por ĉi tiu noda tipo.
eu: Nodo-mota honetarako hautatutako ID.
he: המזהה הנבחר לטיפוס הצומת הזה.
ka: მონიშნული ID ამ კვანძის ტიპისთვის.

# @info:tooltip
source: The selected ID is already used for another node type, please select a different one.
ar: المعرّف المختار قيد الاستخدام بالفعل لنوع عقدة آخر، اختر معرّفًا مختلفًا.
eo: La elektita ID jam estas uzata por alia nodotipo, bonvolu elekti alian.
eu: Hautatutako ID jada beste nodo-mota baterako erabiltzen da, mesedez, hautatu beste bat.
he: המזהה שנבחר כבר משמש לטיפוס צומת אחר, נא לבחור מזהה אחר.
ka: მონიშნული ID უკვე გამოიყენება სხვა კვანძის ტიპისთვის. აირჩიეთ სხვა.

source: Add Property
ar: أضف خاصية
eo: Aldoni Trajton
eu: Gehitu propietatea
he: הוספת מאפיין
ka: თვისების დამატება

source: Delete this property.
ar: احذف هذه الخاصية.
eo: Forigu ĉi tiun trajton.
eu: Ezabatu propietate hau.
he: מחיקת המאפיין הזה.
ka: ამ თვისების წაშლა.

# @title:window
source: Assign Values
ar: اسند قيمًا
eo: Atribui Valorojn
eu: Esleitu balioak
he: השמת ערכים
ka: მნიშვნელობების მინიჭება

source: All Data Types
ar: جميع أنواع البيانات
eo: Ĉiuj Tipoj de Datumoj
eu: Datu-mota guztiak
he: כל טיפוסי הנתונים
ka: მონაცემების ყველა ტიპი

source: All Edge Types
ar: جميع أنواع الحواف
eo: Ĉiuj Eĝtipoj
eu: Ertz-mota guztiak
he: כל טיפוסי הצלעות
ka: კიდის ყველა ტიპი

source: Enter Property Name
ar: أدخل اسم الخاصية
eo: Enigi Trajtnomon
eu: Sartu propietate-izena
he: נא למלא שם מאפיין
ka: შეიყვანეთ თვისების სახელი

source: Assign Values
ar: اسند قيمًا
eo: Atribui Valorojn
eu: Esleitu balioak
he: השמת ערכים
ka: მნიშვნელობების მინიჭება

source: Choose Properties
ar: اختر الخاصيات
eo: Elekti Trajtojn
eu: Hautatu propietateak
he: בחירת מאפיינים
ka: აირჩიეთ თვისებები

source: Show advanced options.
ar: أظهر الخيارات المتقدّمة
eo: Montri altnivelajn opciojn.
eu: Erakutsi aukera aurreratuak.
he: הצגת אפשרויות מתקדמות.
ka: დამატებითი პარამეტრების ჩვენება.

source: Assignment Method
ar: طريقة الإسناد
eo: Atribu-Metodo
eu: Esleipen metodoak
he: שיטת השמה
ka: მინიჭების მეთოდი

source: Enumerate Items
ar: عدّد العناصر
eo: Nombri Erojn
eu: Elementuak zerrendatu
he: ספירת פריטים
ka: ჩანაწერების ჩამონათვალი

source: Enumerate Alpha
ar: عدّد أبجدياً
eo: Nombri Alfa
eu: Alfabetikoki zerrendatu
he: ספירת אלפא
ka: ალფას ჩამონათვალი

source: Enumerate Alpha-Numeric
ar: عدّد أبجدياً رقمياً
eo: Nombri Alfa-Ciferece
he: ספירת אלפא-נומריות
ka: ალფა-რიცხვების ჩამონათვალი

source: Assign Random Integers
ar: اسند أعداداً صحيحة عشوائية
eo: Atribui Hazardajn Entjerojn
eu: Ausazko zenbaki osoak esleitu
he: השמת מספרים שלמים אקראיים
ka: შემთხვევითი მთელი რიცხვის მინიჭება

source: Assign Random Reals
ar: اسند أعداداً حقيقية عشوائية
eo: Atribui Hazardajn Realnombrojn
eu: Ausazko zenbaki errealak esleitu
he: השמת מספרים אמיתיים אקראיים
ka: შემთხვევითი რეალური რიცხვის მინიჭება

source: Assign Constant Value
ar: اسند قيمة ثابتة
eo: Atribui Konstantan Valoron
eu: Balio konstanteak esleitu
he: השמת ערך קבוע
ka: კონსტანტის მნიშვნელობის მინიჭება

source: Start ID:
ar: المعرّف البادئ:
eo: Komenca ID:
he: מזהה התחלה:
ka: საწყისი ID:

source: Initial string
ar: سلسلة نصية بادئة
eo: Komenca ĉeno
he: מחרוזת התחלתית
ka: საწყისი სტრიქონი

source: a
ar: أ
he: א

source: Start ID
ar: المعرّف البادئ
eo: Komenca ID
he: מזהה התחלה
ka: საწყისი ID

source: Prefix
ar: السابقة
eo: Prefikso
eu: Aurrizkia
he: קידומת
ka: პრეფიქსი

source: Lower Limit
ar: النهاية الصغرى
eo: Malsupra Limo
eu: Behe-muga
he: גבול תחתון
ka: ქვედა ლიმიტი

source: Upper Limit
ar: النهاية العليا
eo: Supra Limo
eu: Goi-muga
he: גבול עליון
ka: ზედა ლიმიტი

source: Generator Seed
ar: بذرة المولد
eo: Generatora Semo
eu: Sortzailearen hazia
he: גרעין המחולל
ka: თესლის გენერაცია

source: Constant
ar: ثابت
eo: Konstanta
eu: Konstantea
he: קבוע
ka: კონსტანტა

source: Overwrite existing values
ar: اكتب فوق القيم الموجودة
eo: Anstataŭigi ekzistantajn valorojn
eu: Gainidatzi dauden balioak
he: דריסת ערכים קיימים
ka: არსებულ მნიშვნელობებზე გადაწერა

source: Nodes:
ar: العقد
eo: Nodoj:
eu: Nodoak:
he: צמתים:
ka: კვანძები:

source: Property name:
ar: اسم الخاصية:
eo: Propraĵa nomo:
eu: Propietate-izena:
he: שם מאפיין:
ka: თვისების სახელი:

source: Edges:
ar: الحواف:
eo: Eĝoj:
eu: Ertzak:
he: צלעות:
ka: კიდეები:

source: Assign values to selected edges.
ar: اسند قيمًا للحواف المختارة.
eo: Atribui valorojn al elektitaj eĝoj.
eu: Esleitu balioak hautatutako ertzei.
he: השמת ערכים לצלעות הנבחרות.
ka: მნიშვნელობების მინიჭება მონიშნული წიბოებისთვის.

source: Assign values to selected nodes.
ar: اسند قيمًا للعقد المختارة.
eo: Atribui valorojn al elektitaj nodoj.
eu: Esleitu balioak hautatutako nodoei.
he: השמת ערכים לצמתים הנבחרים.
ka: მნიშვნელობების მინიჭება მონიშნული კვანძებისთვის.

# @title:window
source: Generate Graph
ar: توليد رسم بياني
eo: Generi Grafikon
eu: Sortu grafoa
he: יצירת גרף
ka: გრაფის გენერაცია

# @item:inlistbox
source: %1 (ID %2)
ar: %1 (المعرّف %2)
eu: %1 (%2 ID)
he: %1 (מזהה %2)

source: Incorrect Edge Direction
ar: اتجاه حافة غير صحيح
eo: Malĝusta Eĝdirekto
he: כיוון צלע שגוי
ka: არასწორი წიბოს მიმართულება

source: Edges in a Directed Acyclical Graph must be directional.
ar: حواف الرسم البياني الموجه اللا دوري يجب أن تكون موجّهة.
eo: Eĝoj en Direktita Acikla Grafeo devas esti direktaj.
he: צלעות בגרף חסר מעגלים מכוון חייבות להיות כיווניות.
ka: მიმართულ აციკლურ გრაფში წიბოები მიმართული უნდა იყოს.

source: Generate Graph
ar: توليد رسم بياني
eo: Generi Grafikon
eu: Sortu grafoa
he: יצירת גרף
ka: გრაფის გენერაცია

source: Select the graph generator.
ar: اختر مُولّد الرسم البياني.
eo: Elekti la grafean generatoron.
eu: Hautatu grafo-sortzailea
he: בחירת מחולל הגרפים.
ka: აირჩიეთ გრაფის გენერატორი.

source: Mesh Graph
ar: رسم بياني شبكي
eo: Maŝgrafeo
he: גרף רשת
ka: გრაფი-ბადე

source: Star Graph
ar: رسم بياني نجمي
eo: Stelgrafeo
eu: Izar grafoa
he: גרף כוכב
ka: გრაფი-ვარსკვლავი

source: Circle Graph
ar: مخطط دائرة
eo: Cirkla Grafeo
eu: Zirkulu grafoa
he: גרף מעגלי
ka: გრაფი-წრეწირი

source: Random Graph
ar: رسم بياني عشوائي
eo: Hazarda Grafeo
eu: Ausazko grafoa
he: גרף אקראי
ka: შემთხვევითი გრაფი

source: Erdös-Renyi Graph
ar: رسم بياني إردوش-رينيي
eo: Erdös-Renyi Grafeo
eu: Erdös-Renyi grafoa
he: גרף ארדש-רניי
ka: ერდიოს-რენიის გრაფი

source: Random Tree Graph
ar: رسم بياني شجري عشوائي
eo: Hazarda Arbgrafeo
eu: Ausazko zuhaitz grafoa
he: גרף עץ אקראי
ka: შემთხვევითი ხისებური გრაფი

source: Random Dag Graph
ar: رسم بياني DAG عشوائي
eo: Hazarda Dag-Grafeo
he: גרף חסר מעגלים מכוון אקראי
ka: შემთხვევითი აციკლური გრაფი

source: Path Graph
ar: رسم بياني مسار
eo: Voja Grafeo
he: גרף מסלול
ka: გრაფი-ბილიკი

source: Complete Graph
ar: رسم بياني كامل
eo: Kompleta Grafeo
he: גרם מלא
ka: სრული გრაფი

source: Complete Bipartite
ar: ثنائي الأجزاء الكامل
eo: Kompleta Dupartia
he: גרף דו־צדדי מלא
ka: სრული ორმხრივი

source: Show advanced settings.
ar: أظهر الإعدادات المتقدّمة
eo: Montri altnivelajn agordojn.
eu: Erakutsi ezarpen aurreratuak.
he: הצגת הגדרות מתקדמות.
ka: დამატებითი პარამეტრების ჩვენება.

source: Set the unique identifier of the generated graph.
ar: اضبط المعرّف الفريد للرسم البياني المولّد.
eo: Agordi la unikan identigilon de la generita grafeo.
eu: Ezarri sortutako grafoaren identifikatzaile bakarra.
he: הגדרת המזהה הייחודי של הגרף שנוצר.
ka: გენერირებული გრაფის უნიკალური იდენტიფიკატორის დაყენება.

source: Graph
ar: رسم بياني
eo: Grafeo
eu: Grafoa
he: גרף
ka: გრაფი

source: The node type to create the nodes of the graph with
ar: نوع العقدة الذي ولّد به عقد الرسم البياني.
eo: La noda tipo por krei la nodojn de la grafeo kun
he: טיפוס הצומת ליצירת צמתים בגרף
ka: კვანძის ტიპი გრაფის კვანძების შესაქმნელად

source: Node type:
ar: نوع العقدة:
eo: Noda tipo:
eu: Nodo-mota:
he: טיפוס צומת:
ka: კვანძის ტიპი:

source: The identifier of the created graph (used for scripting)
ar: معرّف الرسم البياني الذي ولّد (يُستخدم للبرمجة النصية)
eo: La identigilo de la kreita grafeo (uzata por skripto)
he: מזהה הגרף שנוצר (שימושי לסקריפטים)
ka: შექმნილი გრაფის იდენტიფიკატორი (გამოიყენება სკრიპტებში)

source: Number of Columns:
ar: عدد الأعمدة:
eo: Nombro da Kolumnoj:
eu: Zutabe kopurua:
he: מספר העמודות:
ka: სვეტების რაოდენობა:

source: Number of Rows:
ar: عدد الصّفوف:
eo: Nombro da Vicoj:
eu: Errenkada kopurua:
he: מספר השורות:
ka: მწკრივების რიცხვი:

source: Satellite Nodes:
ar: عقد أقمار:
eo: Satelitnodoj:
eu: Satelite nodoak:
he: צמתים לווייניים:
ka: თანამგზავრი კვანძები:

source: Number of Nodes:
ar: عدد العقد:
eo: Nombro da Nodoj:
eu: Nodo kopurua:
he: מספר הצמתים:
ka: კვანძების რიცხვი:

source: Allow self-edges:
ar: اسمح بالحواف الذاتية:
eo: Permesi mem-eĝojn:
he: לאפשר צלעות עצמיות:
ka: თვითწიბოების დაშვება:

source: Generator seed:
ar: بذرة المولد:
eo: Generatora semo:
eu: Sortzailearen hazia:
he: גרעין המחולל:
ka: თესლის გენერაცია:

source: Nodes (n):
ar: العقد (ن):
eo: Nodoj (n):
eu: Nodoak (n):
he: צמתים (צ):
ka: კვანძები (n):

source: Edge Probability (p):
ar: احتمالية الحافة (ف):
eo: Eĝa Probablo (p):
eu: Ertz probabilitatea (p):
he: סבירות צלע (ס):
ka: წიბოს ალბათობა (p):

source: Generator Seed:
ar: بذرة المولد:
eo: Generatora Semo:
eu: Sortzailearen hazia:
he: גרעין המחולל:
ka: თესლის გენერაცია:

source: Number of Nodes
ar: عدد العقد
eo: Nombro de Nodoj
eu: Nodo kopurua
he: מספר הצמתים
ka: კვანძების რიცხვი

source: Edge Probability
ar: احتمالية الحافة
eo: Eĝa Probableco
eu: Ertz probabilitatea
he: סבירות צלע
ka: წიბოს ალბათობა

source: Left Set Nodes:
ar: عقد المجموعة اليسرى:
eo: Maldekstraj Aro-Nodoj:
he: צומתי סדרה שמאלית:
ka: მარცხნივ დაყენებული კვანძები:

source: Right Set Nodes:
ar: عقد المجموعة اليمنى:
eo: Dekstraj Aro Nodoj:
he: צומתי סדרה ימנית:
ka: მარჯვნივ დაყენებული კვანძები:

source: Select the edge type for connections of the generated graph.
ar: اختر نوع الحافة لوصلات الرسم البياني المولّد.
eo: Elekti la eĝspecon por konektoj de la generita grafeo.
he: נא לבחור את טיפוס הצלע לחיבורים של הגרף שנוצר.
ka: აირჩიეთ წიბოს ტიპი გენერირებული გრაფის კავშირებისთვის.

source: The edge type to create the edges of the graph with
ar: نوع الحافة الذي ولّد به حواف الرسم البياني.
eo: La eĝtipo kun kiu krei la eĝojn de la grafeo
he: טיפוס הצלע ליצירת צלעות הגרף
ka: წიბოს ტიპი გრაფის წიბოების შესაქმნელად

source: Edge type:
ar: نوع الحافة:
eo: Eĝotipo:
eu: Ertz mota:
he: טיפוס צלע:
ka: კიდის ტიპი:

source: Graph generator:
ar: مُولّد الرسم البياني:
eo: Grafegeneratoro:
eu: Grafo sortzailea:
he: מחולל גרפים:
ka: გრაფის გენერატორი:

source: Select the node type for node elements of the generated graph.
ar: اختر نوع العقدة لعناصر عقد الرسم البياني المولّد.
eo: Elektu la nodan tipon por nodaj elementoj de la generita grafeo.
he: נא לבחור את טיפוס הצומת ליסודות הצומת של הגרף שנוצר.
ka: აირჩიეთ კვანძის ტიპი გენერირებული გრაფის კვანძის ელემენტებისთვის.

# @title:window
source: Graph Layout
ar: تخطيط الرسم
eo: Grafea Aranĝo
eu: Grafoaren antolaera
he: פריסת גרף
ka: გრაფის განლაგება

source: Graph Layout
ar: تخطيط الرسم
eo: Grafea Aranĝo
eu: Grafoaren antolaera
he: פריסת גרף
ka: გრაფის განლაგება

source: Force Based Layout
ar: تخطيط يعتمد على القوة
eo: Fortobazita Aranĝo
he: פריסה מבוססת כוח
ka: განლაგება ძალით

source: Area factor:
ar: عامل المساحة:
eo: Areofaktoro:
he: מקדם אזור:
ka: სამუშაო ფართობი:

source: Repelling force:
ar: قوة التنافر:
eo: Forpuŝa forto:
eu: Uxatze indarra:
he: כוח דוחה:
ka: განზიდვის ძალა:

source: Attraction force:
ar: قوة الجذب:
eo: Altira forto:
eu: Erakarpen indarra:
he: כוח משיכה:
ka: მიზიდულობის ძალა:

source: Radial Tree Layout
ar: تخطيط شجرة شعاعي
eo: Radiala Arbaranĝo
he: פריסת עץ מעגלית
ka: რადიალური ხის განლაგება

source: Center/Root:
ar: المركز/الجذر:
eo: Centro/Radiko:
he: מרכז/שורש:
ka: ცენტრი/ძირითადი:

source: Node separation:
ar: فصل العقدة:
eo: Noda apartigo:
he: הפרדת צמתים:
ka: კვანძის გამოყოფა:

source: Tree type:
ar: نوع الشجرة:
eo: Tipo de arbo:
eu: Zuhaitz-mota:
he: טיפוס עץ:
ka: ხის ტიპი:

source: Free tree
ar: شجرة حرة
eo: Senpaga arbo
he: עץ חופשי
ka: თავისუფალი ხე

source: Rooted tree
ar: شجرة مجذّرة
eo: Enradikita arbo
he: עץ מושרש
ka: ფესვიანი ხე

# @title:window
source: Transform Edges
ar: تحويل الحواف
eo: Transformi Eĝojn
eu: Eraldatu ertzak
he: התמרת צלעות
ka: კიდეების გარდაქმნა

source: Transform Edges
ar: تحويل الحواف
eo: Transformi Eĝojn
eu: Eraldatu ertzak
he: התמרת צלעות
ka: კიდეების გარდაქმნა

source: This option connects all nodes of the given graph. The new edges do not have any preset weights.
ar: يربط هذا الخيار جميع عقد الرسم البياني المعطى. لا تحمل الحواف الجديدة أية أوزان مسبقة.
eo: Ĉi tiu opcio ligas ĉiujn nodojn de la donita grafeo. La novaj randoj ne havas antaŭfiksitajn pezojn.
he: האפשרות הזאת מחברת את כל הצמתים של גרף מסוים. לצלעות החדשות אין משקלות מוגדרות מראש.
ka: ეს არჩევანი მოცემული გრაფის ყველა კვანძს დააკავშირებს. ახალ წიბოებს არ აქვს წინასწარ დაყენებული წონა.

source: Complete graph
ar: رسم بياني كامل
eo: Kompleta grafeaĵo
he: גרף מלא
ka: სრული გრაფი

source: This option removes all edges from the given graph.
ar: يزيل هذا الخيار جميع الحواف من الرسم البياني المعطى.
eo: Ĉi tiu opcio forigas ĉiujn eĝojn de la donita grafeo.
he: האפשרות הזאת מסירה את כל הצלעות מהגרף שצוין.
ka: ეს არჩევანი მოცემული გრაფის ყველა წიბოს წაშლის.

source: Remove all edges
ar: احذف جميع الحواف
eo: Forigi ĉiujn eĝojn
eu: Kendu ertz guztiak
he: הסרת כל הצלעות
ka: ყველა წიბოს წაშლა

source: This option reverses all edges of a directed graph. Note that this does not apply to undirected graphs.
ar: يعكس هذا الخيار جميع حواف الرسم البياني الموجه. لاحظ أن هذا لا ينطبق على الرسوم البيانية غير الموجهة.
eo: Ĉi tiu opcio inversigas ĉiujn eĝojn de direktita grafeo. Notu, ke tio ne validas por nedirektaj grafeaĵoj.
he: האפשרות הזאת הופכת את כל הצלעות של גרף כיווני. נא לשים לב שאין לזה השפעה על גרפים ללא כיוון.
ka: ეს არჩევანი მიმართული გრაფის ყველა წიბოს შეაბრუნებს. გაითვალისწინეთ, რომ ეს არ ეხება არამიმართულ გრაფებს.

source: Reverse all edges
ar: اعكس جميع الحواف
eo: Reversigi ĉiujn eĝojn
he: היפוך כל הצלעות
ka: ყველა წიბოს შებრუნება

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'DejaVu Sans'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">This option executes <span style=" font-style:italic;">Prim's Minimal Spanning Tree Algorithm</span> at the graph. All edges without given weights are assumed to have weights equals 1. Directed and undirected graphs are processed accordingly.</p></body></html>
ar: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'DejaVu Sans'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">ينفّذ هذا الخيار <span style=" font-style:italic;">خوارزمية بريم لشجرة الامتداد الأصغر</span> على الرسم البياني. تُفترض أوزان جميع الحواف بدون أوزان معطاة مساوية لـ 1. تُعالج الرسوم البيانية الموجهة وغير الموجهة وفقًا لذلك.</p></body></html>
eo: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'DejaVu Sans'; font-size:9pt; font-weight:400; font-style:normal;"> < p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Tiu opcio efektivigas <span style=" font-style:italic;">Algoritmo de Minimume Ampleksa Arba de Prim</span> ĉe la grafeaĵo. Ĉiuj eĝoj sen donitaj pezoj estas supozitaj havi pezojn egalajn al 1. Direktitaj kaj nedirektitaj grafeaĵoj estas prilaboritaj laŭe.</p></body></html>
he: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'DejaVu Sans'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">האפשרות הזאת מריצה <span style=" font-style:italic;">האלגוריתם של פרים למציאת עץ פורש מינימלי</span> בגרף. לכל הצלעות שלא צוינו עבורם משקלות מניחים שיש להם משקולות ששוותל־1. גרפים מכוונים וללא כיוון מעובדים בהתאם.</p></body></html>
ka: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'DejaVu Sans'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">ეს არჩევანი შეასრულებს<span style=" font-style:italic;">Prim-ის მინიმალური ძირითადი ხის ალგორითმს</span> გრაფთან. ყველა წიბო, რომელსაც არ აქვს მოცემული წონა, აღქმული იქნება, როგორც 1-ის ტოლი წონის. მიმართული და არამიმართული გრაფები შესაბამისად დამუშავდება.</p></body></html>

source: Spanning tree transformation
ar: تحويل شجرة الامتداد
eo: Ampleksanta arbo-transformo
he: התמרת העץ הפורס
ka: ძირითადი ხის გარდაქმნა

source: Remove all self edges
ar: احذف جميع الحواف الذاتية
eo: Forigi ĉiujn memeĝojn
he: הסרת כל הצלעות העצמיות
ka: ყველა თვითწიბოს წაშლა

source: Graphviz Format (%1)
ar: تنسيق Graphviz (%1)
eo: Graphviz Formato (%1)
eu: Graphviz formatua (%1)
he: תסדיר Graphviz‏ (%1)
ka: Graphviz-ის ფორმატი (%1)

source: Could not open file "%1" in read mode: %2
ar: تعذّر فتح الملف «%1» في وضع القراءة: %2
eo: Ne eblis malfermi dosieron "%1" en legoreĝimo: %2
eu: Ezin izan du "%1" fitxategia irakurtzeko moduan ireki: %2
he: לא ניתן לפתוח את הקובץ „%1” במצב קריאה: %2
ka: ფაილის ("%1") წასაკითხად გახსნის შეცდომა: %2

source: Could not parse file "%1".
ar: تعذّر تحليل الملف «%1».
eo: Ne eblis analizi dosieron "%1".
he: לא ניתן לפענח את הקובץ „%1”.
ka: "%1" ფაილის დამუშავების შეცდომა.

source: Cannot open file %1 to write document. Error: %2
ar: لا يمكن فتح الملف %1 لكتابة المستند. الخطأ: %2
eo: Ne povas malfermi dosieron %1 por skribi dokumenton. Eraro: %2
eu: Ezin du %1 fitxategia dokumentua idazteko ireki. Errorea: %2
he: לא ניתן לפתוח את הקובץ %1 לכתיבת מסמך. שגיאה: %2
ka: ვერ გავხსენი ფაილი %1 დოკუმენტის ჩასაწერად. შეცდომა: %2

# @title:window
source: Plugin Error
ar: خطأ في الملحقة
eo: Kromprograma Eraro
ka: დამატების შეცდომა

source: Plugins could not be found in specified directories:<br>
ar: تعذّر إيجاد الملحقات في المجلّدات المحددة:<br>
eo: Kromaĵoj ne troveblas en specifitaj dosierujoj:<br>
ka: მითითებულ საქაღალდეებში დამატებები აღმოჩენილი არაა:<br>

source: <br><br> Check <a href='https://doc.qt.io/qt-5/deployment-plugins.html'>this link</a> for further information.
ar: <br><br> راجع <a href='https://doc.qt.io/qt-5/deployment-plugins.html'>هذا الرابط</a> للحصول على مزيد من المعلومات.
eo: <br><br> Kontrolu <a href='https://doc.qt.io/qt-5/deployment-plugins.html'>ĉi tiun ligon</a> por pliaj informoj.
ka: <br><br> მეტი ინფორმაციისთვის გადახედეთ <a href='https://doc.qt.io/qt-5/deployment-plugins.html'>ამ ბმულს</a>.

source: Graph Markup Language Format (%1)
ar: تنسيق لغة ترميز الرسم البياني (%1)
eo: Grafea Markad-Lingva Formato (%1)
eu: Grafo marka lengoaiaren formatua (%1)
he: תסדיר שפת סימון גרפים Graph‏ (%1)
ka: გრაფის აღწერის ენის ფორმატი (%1)
