Repository: KDE/rocs
Catalog: po/*/rocs.po
Languages: eo, eu, he

# NAME OF TRANSLATORS
source: Your names
eo: Axel Rousseau,Oliver Kellogg
eu: Iñigo Salvador Azurmendi
he: צוות התרגום של KDE ישראל

# EMAIL OF TRANSLATORS
source: Your emails
eo: axel@esperanto-jeunes.org,okellogg@users.sourceforge.net
eu: xalba@ni.eus
he: kde-l10n-he@kde.org

# @title Short program description
source: Graph Theory Simulator
eo: Simulilo pri Grafika Teorio
eu: Grafoen Teoria simulatzailea
he: מדמה לתאוריית הגרפים

# @info:credit
source: (c) 2008-2016 Rocs Developers
eo: (c) 2008-2016 Rocs-Programistoj
eu: (c) 2008-2016 Rocs garatzaileak
he: ‏(c) 2008‏-2016 מפתחי Rocs

# @info:credit Developer name
source: Andreas Cord-Landwehr
he: אנדראס קורד־לנדוור

# @info:credit Role
source: Maintainer
eo: Prizorganto
eu: Mantentzailea
he: מתחזק

# @info:credit Developer name
source: Tomaz Canabrava
he: טומאש קנאבראווה

# @info:credit Role
source: Original Author
eo: Originala Aŭtoro
eu: Jatorrizko egilea
he: יוצר מקורי

# @info:credit Developer name
source: Wagner Reck
he: וגנר רק

# @info:credit Role
source: Developer
eo: Ellaboranto
eu: Garatzailea
he: מפתח

source: Project to open.
eo: Projekto por malfermi.
eu: Ireki beharreko proiektua.
he: מיזם לפתיחה.

# @title
source: Syntax
eo: Sintakso
eu: Sintaxia
he: תחביר

# @title
source: Properties
eo: Trajtoj
eu: Propietateak
he: מאפיינים

# @title
source: Parameters
eo: Parametroj
eu: Parametroak
he: משתנים

# @title
source: Parameter
eo: Parametro
eu: Parametroa
he: משתנה

# @title
source: Methods
eo: Metodoj
eu: Metodoak
he: מתודות

# @title
source: Type
eo: Tipo
eu: Mota
he: טיפוס

# @title
source: Return Type
eo: Revena Tipo
eu: Itzulera mota
he: טיפוס החזרה

# @title
source: Detailed Description
eo: detala priskribo
eu: Deskribapen zehatza
he: תיאור מפורט

# @title
source: Description
eo: Priskribo
eu: Deskribapena
he: תיאור

# @title
source: Script Engine API
eu: Gidoi-motorraren API
he: API למנוע סקריפטים

# @title
source: The Graph Document
eo: La Grafika Dokumento
eu: Grafo dokumentua
he: מסמך הגרף

# @title
source: Objects
eo: Objektoj
eu: Objektuak
he: עצמים

# @title
source: Script Engine Modules
eo: Script Engine Moduloj
eu: Gidoi-motorraren moduluak
he: מודול למנוע סקריפטים

source: Script Objects
eo: Skripto Objektoj
eu: Gidoi-objektuak
he: עצמי סקריפטים

source: Properties
eo: Propraĵoj
eu: Propietateak
he: מאפיינים

source: Methods
eo: Metodoj
eu: Metodoak
he: מתודות

source: Rocs Scripting API
eu: Rocs gidoietarako API
he: API לסקריפטים של Rocs

source: Show text beside icon
eo: Montri tekston apud piktogramo
eu: Erakutsi testua ikonoaren ondoan
he: הצגת טקסט לצד סמלים

source: Path where include manager seek for includes.
eo: Vojo kie inklud-mastrumilo serĉu inkludojn.
he: הנתיב שבו מנהל ההכללה יחפש פריטים נכללים (include).

source: Project
eo: Projekto
eu: Proiektua
he: מיזם

source: Script Document
eo: Skripto Dokumento
eu: Gidoi-dokumentua
he: מסמך סקריפט

source: Graph Document
eo: Grafika Dokumento
eu: Grafo-dokumentua
he: מסמך גרף

source: Graph File
eo: Grafea Dosiero
eu: Grafo-fitxategia
he: קובץ גרף

source: Edit Selected Data
eo: Redakti Elektitajn Datumojn
eu: Editatu hautatutako datuak
he: עריכת הנתונים הנבחרים

source: Layout
eo: Aranĝo
eu: Antolaera
he: פריסה

source: Tools
eo: Iloj
eu: Tresnak
he: כלים

# @title
source: Code Document Name
eo: Koda Dokumenta Nomo
eu: Kode-dokumentuaren izena
he: שם מסמך קוד

source: Enter the name of your code document
eo: Enigu la nomon de via koddokumento
eu: Sartu zure kode-dokumentuaren izena
he: נא למלא את שם מסמך הקוד שלך

# @title
source: Node Types
eo: Nodaj Tipoj
eu: Nodo motak
he: טיפוסי צמתים

source: Create Type
eo: Krei Tipon
eu: Sortu mota
he: יצירת טיפוס

# @title
source: Edge Types
eo: Eĝaj Tipoj
eu: Ertz mota
he: טיפוסי צלעות

source: unnamed
eo: nenomita
eu: izengabea
he: ללא_שם

source: Direction of edges of edge type.
eo: Direkto de eĝoj de eĝtipo.
eu: Ertz motako ertzen noranzkoa.
he: כיוון הצלעות לטיפוס צלע.

source: Unique ID of edge type.
eo: Unika ID de eĝotipo.
eu: Ertz-motaren ID bakarra.
he: מזהה ייחודי של טיפוס צלע.

# @action:button
source: Export
eo: Eksporti
eu: Esportatu
he: ייצוא

source: <p>The file <br /><strong>'%1'</strong><br /> already exists; if you do not want to overwrite it, change the file name to something else.</p>
eo: <p>La dosiero <br /><strong>'%1'</strong><br /> jam ekzistas; se vi ne volas anstataŭigi ĝin, ŝanĝu la dosiernomon al io alia.</p>
eu: <p>Jada badago<br /><strong>'%1'</strong><br />fitxategia; hura gainidatzi nahi ez baduzu, fitxategi-izena alda ezazu.</p>
he: <p>הקובץ <br /><strong>‚%1’</strong><br /> כבר קיים, כדי לא לשכתב עליו, עדיף לשנות את שם הקובץ לשם אחר.</p>

source: File Exists
eo: Dosiero Ekzistas
eu: Fitxategia badago
he: הקובץ קיים

source: <p>Cannot resolve suffix of file <strong>'%1'</strong> to an available file backend. Aborting export.</p>
eo: <p>Ne povas solvi sufikson de dosiero <strong>'%1'</strong> al disponebla dosiera backend. Ĉesigi eksportadon.</p>
he: <p>לא ניתן לפתור את סיומת הקובץ <strong>‚%1’</strong> למנגנון קבצים זמין. הייצוא מבוטל באופן גורף.</p>

source: <p>Error occurred when writing file: <strong>'%1'</strong></p>
eo: <p>Eraro okazis dum skribado de dosiero: <strong>'%1'</strong></p>
eu: <p>Fitxategia idaztean errorea gertatu da: <strong>'%1'</strong></p>
he: <p>אירעה שגיאה בכתיבת קובץ: <strong>‚%1’</strong></p>

source: *|All files
eo: *|Ĉiuj dosieroj
eu: *|Fitxategi guztiak
he: *|כל הקבצים

# @title:window
source: Import Graph File into Project
eo: Importi Grafean Dosieron en Projekton
eu: Inportatu grafo-fitxategia proiektuan
he: ייבוא קובץ גרף למיזם

# @title
source: Graph Document Name
eo: Grafea Dokumentnomo
eu: Grafo-dokumentuaren izena
he: שם מסמך גרף

source: Enter the name of your graph document
eo: Enigu la nomon de via grafea dokumento
eu: Sartu zure grafo-fitxategiaren izena
he: נא למלא את שם מסמך הגרף שלך

source: Project Journal
eo: Projekta Revuo
eu: Proiektuaren egunerokoa
he: יומן מיזם

# @action:intoolbar Script Execution
source: Run
eo: Kuri
eu: Exekutatu
he: הרצה

# @info:tooltip
source: Execute currently active script on active graph document.
eo: Efektivigi aktuale aktivan skripton sur aktiva grafea dokumento.
eu: Exekutatu unean aktibo dagoen gidoia grafo-dokumentu aktiboan.
he: הרצת הסקריפט שפעיל כרגע במסמך הגרף הפעיל.

# @action:intoolbar Script Execution
source: Stop
eo: Halti
eu: Gelditu
he: עצירה

# @info:tooltip
source: Stop script execution.
eo: Ĉesi skripto-plenumon.
eu: Gelditu gidoiaren exekuzioa.
he: עצירת הרצת הסקריפט.

source: Element Types
eo: Elementaj Tipoj
eu: Elementu motak
he: טיפוסי רכיבים

# @title
source: Journal
eo: Ĵurnalo
eu: Egunerokoa
he: יומן

# @title
source: Scripting API
eo: Skripta API
eu: Gidoietarako API
he: API לסקריפטים

# @action:inmenu
source: New Project
eo: Nova Projekto
eu: Proiektu berria
he: מיזם חדש

# @action:inmenu
source: Save Project
eo: Konservi Projekton
eu: Gorde proiektua
he: שמירת מיזם

# @action:inmenu
source: Open Project...
eo: Malfermi Projekton...
eu: Ireki proiektua...
he: פתיחת מיזם…

# @action:inmenu
source: Recent Projects
eo: Lastatempaj Projektoj
eu: Azken aldiko proiektuak
he: מיזמים אחרונים

# @action:inmenu
source: Save Project As...
eo: Konservi Projekton kiel...
eu: Gorde proiektua honela...
he: שמירת מיזם בשם…

# @action:inmenu
source: New Graph Document
eo: Nova Grafea Dokumento
eu: Grafo-dokumentu berria
he: מסמך גרף חדש

# @action:inmenu
source: New Script File...
eo: Nova Skripto-dosiero...
eu: Gidoi-fitxategi berria...
he: קובץ סקריפט חדש…

# @action:inmenu
source: Import Graph...
eo: Importi Grafeon...
eu: Inportatu grafoa...
he: ייבוא גרף…

# @action:inmenu
source: Export Graph As...
eo: Eksporti Grafeon kiel...
eu: Esportatu grafoa honela...
he: ייצוא גרף בשם…

# @action:inmenu
source: Import Script...
eo: Importi Skripton...
eu: Inportatu gidoia...
he: ייבוא סקריפט…

# @action:inmenu
source: Export Script...
eo: Eksporti Skripton...
eu: Esportatu gidoia...
he: ייצוא סקריפט…

# @title:window
source: Import Script into Project
eo: Importi Skripton en Projekton
eu: Inportatu gidoia proiektuan
he: ייבוא סקריפט למיזם

# @title:window
source: Export Script
eo: Eksporti Skripton
eu: Esportatu gidoia
he: ייצוא סקריפט

source: untitled
eo: sentitola
eu: izengabea
he: ללא_שם

# @title:window
source: Save Project As
eo: Konservi Projekton Kiel
eu: Gorde proiektua honela
he: שמירת מיזם בשם

source: Rocs Projects (*.rocs)
eo: Rocs-Projektoj (*.rocs)
eu: Rocs proiektuak (*.rocs)
he: מיזמי Rocs‏ (‎*.rocs)

# @info
source: A file named "%1" already exists. Are you sure you want to overwrite it?
eo: Dosiero nomita "%1" jam ekzistas. Ĉu vi certas, ke vi volas anstataŭigi ĝin?
eu: Jada badago "%1" izeneko fitxategi bat. Ziur zaude gainidatzi nahi duzula?
he: כבר קיים קובץ בשם „%1”. לשכתב אותו?

# @title:window
source: Overwrite File?
eo: Ĉu anstataŭigi dosieron?
eu: Fitxategia gainidatzi?
he: לשכתב קובץ?

# @title:window
source: Open Project Files
eo: Malfermi Projektdosierojn
eu: Ireki proiektuaren fitxategiak
he: פתיחת קובצי מיזם

source: Rocs projects (*.rocs)
eo: Rocs-projektoj (*.rocs)
eu: Rocs proiektuak (*.rocs)
he: מיזמי Rocs‏ (‎*.rocs)

# @info
source: The Rocs project could not be imported because the project file could not be parsed.
eo: La projekto Rocs ne povis esti importita ĉar la projektdosiero ne povis esti analizita.
eu: Ezin izan du Rocs proiektua inportatu proiektuaren fitxategiaren sintaxi azterketa gainditu ez duelako.
he: לא ניתן לייבא את מיזם ה־Rocs כיוון שלא ניתן לפענח את קובץ המיזם.

# caption text for temporary project
source: [ untitled ]%1
eu: [ izengabea ]%1
he: [ ללא_שם ]%1

source: ScriptName
eu: GidoiIzena
he: שם_סקריפט

source: Enter the name of your new script
eo: Enigu la nomon de via nova skripto
eu: Sartu zure gidoi berriaren izena
he: נא למלא את שם הסקריפט החדש שלך

source: File already exists.
eo: Dosiero jam ekzistas.
eu: Fitxategia jada badago.
he: הקובץ כבר קיים.

# @info
source: Changes on your project are unsaved. Do you want to save your changes?
eo: Ŝanĝoj en via projekto estas nekonservitaj. Ĉu vi volas konservi viajn ŝanĝojn?
eu: Zure proiektuko aldaketak gorde gabe daude. Zure aldaketak gorde nahi dituzu?
he: השינויים למיזם שלך לא נשמרו. לשמור את השינויים?

source: Unique ID of the node type.
eo: Unika ID de la noda tipo.
eu: Nodo-motaren ID bakarra.
he: מזהה ייחודי של טיפוס המזהה.

source: Script output:
eo: Skripto eligo:
eu: Gidoiaren irteera:
he: פלט סקריפט:

source: Clear program output with each execution.
eo: Viŝi programeligon je ĉiu efektivigo.
eu: Exekuzio bakoitzarekin garbitu programaren irteera.
he: פינוי פלט התוכנית בין הרצות.

source: Show debug output.
eo: Montri sencimigan eliron.
he: הצגת פלט ניפוי שגיאות.

source: Clear output.
eo: Forviŝi eligon.
eu: Garbitu irteera.
he: פינוי פלט.

# @title
source: Side Toolbar
eo: Flanka Ilobreto
eu: Alboko barra
he: סרגל כלים צדדי

source: Toggle '%1' view.
eo: Ŝalti '%1'-vidon.
eu: Txandakatu '%1' ikuspegia.
he: החלפת מצב תצוגת ‚%1’.
